# Задайте список из n чисел последовательности (1 + 1 / n)**n и выведите на экран их сумму.

# *Пример:*

# - Для n = 6: [2.0, 2.25, 2.37, 2.44, 2.488, 2.52]     ->       14.072    (Округлять не обязательно)


n = int(input('Введите число n: '))
lst = []
lst_1 = []
for i in range(0, n):
    i = i + 1
    f = (1 + 1 / i)**i
    lst.append(round(f, 2))
lst_1 = lst
print("Для n =", n, lst_1, "->", sum(lst_1))